app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    render json: Book.all

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "xyz"], ["author", "abc"], ["created_at", "2023-04-14 10:48:08.704777"], ["updated_at", "2023-04-14 10:48:08.704777"]]
---
  def create
    book=Book.new(title: params[:title],author: params[:author])

    if book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "zzzzzzzzzzj"], ["author", "xxxxxxxxswy"], ["updated_at", "2023-04-14 11:10:24.753816"], ["id", 3]]
---
  def update
   render Book.find(params[:id]).update(
      title:params[:title],
      author:params[:author],
    )

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Book.find(params[:id]).destroy!